document.addEventListener("DOMContentLoaded", () => {
    
  const menuItems = document.querySelectorAll("nav ul.menu li a");
  const submenus = document.querySelectorAll(".menu_section");
  const mainContent = document.getElementById("main_content");

const contentMap = {
  biography: "<h3>Βιογραφία</h3><p>Περιγραφή της βιογραφίας του ζωγράφου.</p>",
  paintings: "<h3>Πίνακες</h3><p>Κατηγορίες πινάκων και σχετικές πληροφορίες.</p>",
  exhibitions: "<h3>Εκθέσεις</h3><p>Πληροφορίες για εκθέσεις του ζωγράφου.</p>",
  links: "<h3>Σύνδεσμοι</h3><p>Χρήσιμοι σύνδεσμοι.</p>",
  admin: "<h3>Διαχείριση</h3><p>Εργαλεία διαχείρισης για τον διαχειριστή.</p>"
};

const contentm = {
  early_years: "<h3>Πρώτα Χρόνια</h3><p>Ο Νίκος Εγγονόπουλος γεννήθηκε στις 21 Οκτωβρίου 1907 στην Αθήνα και απεβίωσε στις 31 Οκτωβρίου 1985. Η μητέρα του Ερριέτη ήταν από την Αθήνα και ο πατέρας του Παναγιώτης ήταν Κωσταντινουπολίτης από παλαιά φαναριώτικη οικογένεια. Ήταν ο δεύτερος γιος του Παναγιώτη και της Ερριέττης και όλη οι οικογένεια το καλοκαίρι του 1914 ταξίδεψε στην Κωνσταντινούπολη και εγκαθίσταται αναγκαστικά εκεί μετά την κήρυξη του πολέμου.</p>",
  education: "<h3>Εκπαίδευση</h3><p>Από το 1923 έως το 1927 o Νίκος Εγγονόπουλος πραγματοποίησε τις βασικές του σπουδές εσωτερικός σε Λύκειο του Παρισιού και από το Νοέμβριο του 1927 μέχρι και τον Ιούλιο του 1928 υπηρέτησε τη στρατιωτική του θητεία ως στρατιώτης ακροβολιστής στο 1ο Σύνταγμα Πεζικού. Μετά την απόλυσή του εργάστηκε ως μεταφραστής σε τράπεζα και γραφέας στο Πανεπιστήμιο, ενώ παράλληλα πηγαίνει νυχτερινό Γυμνάσιο στο Ψυρρή για να αποκτήσει και ελληνικό απολυτήριο. Το 1930 διορίστηκε στο Υπουργείο Δημοσίων Έργων ως σχεδιαστής στη Διεύθυνση Σχεδίων Πόλεων. Το 1932 γράφτηκε στην Ανώτατη Σχολή Καλών Τεχνών, όπου μαθήτευσε κοντά στον Κωνσταντίνο Παρθένη, ενώ παράλληλα παρακολουθούσε μαθήματα βυζαντινής τέχνης στο εργαστήριο των Φώτη Κόντογλου και Α. Ξυγγόπουλου, μαζί με τον Γιάννη Τσαρούχη. Έκανε ελεύθερες σπουδές σε Παρίσι, Βιέννη, Μόναχο και Ιταλία. Δίδαξε στη Σχολή Αρχιτεκτόνων του Ε.Μ.Π., ζωγραφική, ιστορία της τέχνης και σκηνογραφία από το 1938, διαδοχικά ως επιμελητής, έκτακτος, μόνιμος και τακτικός καθηγητής. Την ίδια περίοδο γνωρίστηκε με άλλους σημαντικούς καλλιτέχνες, μεταξύ των οποίων ο Ανδρέας Εμπειρίκος, ο Γιάννης Μόραλης και ο Τζόρτζιο ντε Κίρικο. Σε όλο το διάστημα των σπουδών ζωγραφικής ο Εγγονόπουλος παρέμεινε στη θέση του στο Υπουργείο και το 1934 τοποθετήθηκε στην Τοπογραφική Υπηρεσία, όπου μετά από έξι χρόνια μονιμοποιήθηκε με τον βαθμό του Σχεδιαστή Α΄ Τάξεως.</p>",
  career: "<h3>Καριέρα</h3><p>Τα πρώτα δείγματα της ζωγραφικής του παρουσιάστηκαν το 1938 στην Έκθεση Τέχνη της Νεοελληνικής Παραδόσεως και αποτελούσαν τέμπερες σε χαρτί, που απεικόνιζαν παλαιά σπίτια της Δυτικής Μακεδονίας. Την ίδια χρονιά το Φεβρουάριο μεταφράζει ποιήματα του Tristan Tzara που δημοσιεύονται στο τεύχος Υπερ(ρ)εαλισμός Α' και τελειώνει τις εργαστηριακές σπουδές στη Σχολή του. Τον Ιούνιο τυπώνεται η πρώτη ποιητική του συλλογή: Μην ομιλείτε εις τον οδηγόν και έτσι σημειώθηκε και η είσοδός του στα ελληνικά γράμματα.Τον Σεπτέμβριο του 1939 εκδόθηκε η δεύτερη ποιητική του συλλογή, Τα Κλειδοκύμβαλα της Σιωπής, ενώ τον Νοέμβριο πραγματοποιήθηκε η πρώτη ατομική έκθεση ζωγραφικής του, στο σπίτι του Νίκου Καλαμάρη. Την ίδια περίοδο εργάστηκε για την παράσταση της Ηλέκτρας του Σοφοκλή στο Θέατρο Κοτοπούλη, σχεδιάζοντας τα κοστούμια των ηθοποιών και συμμετείχε σε ομαδική έκθεση Ελλήνων καλλιτεχνών στη Νέα Υόρκη.Το 1942 συμμετέχει στην «Επαγγελματική» έκθεση ζωγραφικής του Ζαππείου και το ίδιο επαναλήφθηκε και τον επόμενο χρόνο(1943). Το 1945 αποσπάστηκε στο Εθνικό Μετσόβιο Πολυτεχνείο ως βοηθός στην έδρα Διακοσμητικής και Ελευθέρου Σχεδίου, θέση που διατήρησε μέχρι το 1956. Το 1949 εργάστηκε στο Υπουργείο Οικισμού και Ανοικοδομήσεως και σε συνεργασία με την αρχιτεκτονική ομάδα του Δημήτρη Πικιώνη σχεδίαζε νέα κτίρια. Πίνακες του παρουσιάζονται και στο Ελληνικό Περίπτερο της Παγκοσμίου Εκθέσεως της Νέας Υόρκης. Τα επόμενα χρόνια συμμετείχε σε αρκετές ομαδικές εκθέσεις, ενώ το 1954 εκπροσώπησε την Ελλάδα στην 27η Μπιενάλε της Βενετίας με συνολικά 72 έργα του. Την ίδια περίοδο εκλέχθηκε μόνιμος επιμελητής του Πολυτεχνείου και παραιτήθηκε οριστικά από το Υπουργείο Δημοσίων Έργων. Επιπλέον, το Φεβρουάριο του 1963 έστησε ατομική έκθεση ζωγραφικής στο Αθηναϊκό Τεχνολογικό Ινστιτούτο. Το 1958 του απονεμήθηκε το Πρώτο Κρατικό Βραβείο Ποίησης του Υπουργείου Εθνικής Παιδείας για την ποιητική συλλογή Εν Ανθηρώ Έλληνι Λόγω, ενώ το 1966 τιμήθηκε για το ζωγραφικό του έργο από τον βασιλιά Κωνσταντίνο Β΄ με το παράσημο του Χρυσού Σταυρού του Γεωργίου Α΄. Το κρατικό βραβείο ποίησης θα του απονεμηθεί αργότερα για δεύτερη φορά το 1979, καθώς και το παράσημο του Ταξιάρχη του Φοίνικος.Νοέμβριος του 1976 διοργανώνεται έκθεση έργων ζωγραφικής του στην Εταιρεία Σπουδών Νεοελληνικού Πολιτισμού και Γενικής Παιδείας της Σχολής Μωραϊτη, ενώ το Μάρτιο του 1983 γίνεται μία αναδρομική έκθεση του έργου του με 105 πίνακες στην Εθνική Πινακοθήκη / Μουσείο Αλεξάνδρου Σούτζου.</p>",
  posthumous_career:'<h3>Μεταθανάτια καριέρα</h3><p>Πέθανε το 1985 από ανακοπή καρδιάς και η κηδεία του πραγματοποιήθηκε δημοσία δαπάνη στο Α΄ Νεκροταφείο της Αθήνας. Ωστόσο, πίνακές του υπάρχουν στην Εθνική Πινακοθήκη, στις Δημοτικές Πινακοθήκες Αθηνών, Ρόδου, Θεσσαλονίκης, στο Μουσείο Θεάτρου στο Εθνικό Μετσόβιο Πολυτεχνείο και σε ιδιωτικές συλλογές. Πραγματοποιήθηκαν πολλές εκθέσεις στο όνομά του ή για να το τιμήσουν και μερικές από αυτές είναι: Νοέμβριος 1986 Έκθεση στην «Γκαλερί 3» με τίτλο «Νίκος Εγγονόπουλος ζωγραφική 1975-1985», Ιούνιος – Σεπτέμβριος 1991 Έκθεση του Centre Georges Pompidou στο Παρίσι με τίτλο «Surrealistes Grecs», Δεκέμβριος 1995 Έκθεση με τίτλο «Σουρεαλισμός». Η ελληνική διάσταση στην Γκαλερί «Titanium» στην Αθήνα -Έκθεση με τίτλο «Δέκα χρόνια από τον Θάνατο του Νίκου Εγγονόπουλου» στην Γκαλερί «Σκουφά» στην Αθήνα, Καλοκαίρι 1998  Έκθεση με τίτλο «Έλληνες ζωγράφοι και αρχαίο Ελληνικό δράμα: σκηνογραφικές εκδοχές» στο Ευρωπαϊκό κέντρο Δελφών στους Δελφούς, Φεβρουάριος – Απρίλιος 2007 Έκθεση «Εγγονόπουλος 2007: ...ωραίος σαν Έλληνας» στο Διεθνή Αερολιμένα Αθηνών, Νοέμβριος Διήμερο επιστημονικό συνέδριο: «Εγγονόπουλος 2007: Ο ζωγράφος και ο ποιητής» με τη συμμετοχή 35 μελετητών του έργου του από την Ελλάδα και το εξωτερικό στο Μουσείο Μπενάκη, σε συνδιοργάνωση Εθνικού Κέντρου Βιβλίου και Μουσείου Μπενάκη, Νοέμβριος – Ιανουάριος Αναδρομική έκθεση Νίκος Εγγονόπουλος: Είμαι ζωγράφος και ποιητής που οργανώνει το Μουσείο Μπενάκη με 250 περίπου αντιπροσωπευτικά έργα απο τις πέντε δεκαετίες της εικαστικής του παραγωγής. Την έκθεση επιμελήθηκαν, ως προς το εικαστικό σκέλος, η Κατερίνα Περπινιώτη-Αγκαζίρ και ως προς το ποιητικό, ο Θανάσης Χατζόπουλος. Το σχεδιασμό της ανέλαβε η Λίλη Πεζανού, 2012 - 2013 The Desire for Freedom. Art in Europe since 1945 Ομαδική Έκθεση οργανωμένη από το Deutsches Historisches Museum στο Βερολίνο, στο πλαίσιο του 30ου Συμβουλίου της Ευρώπης (17 Οκτωβρίου 2012 - 10 Φεβρουαρίου 2013 και μετά: 15.3 -2.6ου. 2013 Palazzo Reale, Μιλάνο, 28.6 - 3.11.2013 Kumu Kunstimuuseum, Ταλίν, 18.11.2013 - 26.1.2014 MOCAK, Κρακοβία, 8.2 - 4.5.2014 ΜΜΣΤ Θεσσαλονίκη), 2016 “Διαιρεμένες μνήμες 1940 - 1950. Η απόσταση ανάμεσα στην ιστορία και το βίωμα” Μακεδονικό Μουσείο Σύγχρονης Τέχνης. Ομαδική έκθεση οργανωμένη από το Goethe Institut Θεσσαλονίκης, το ΜΜΣΤ, το Εβραϊκό Μουσείο Θεσσαλονίκης και το Deutsches Historisches Museum Βερολίνου (7 Δεκεμβρίου - 26 Φεβρουαρίου 2017. Εκτίθενται οι πίνακες: Εμφύλιος Πόλεμος” και “Au rendez-vous Allemand).Το έτος 2007 ανακηρύχθηκε από τον καλλιτεχνικό κόσμο της χώρας ως Έτος Ν. Εγγονόπουλου</p>',
  mythology:'<h3>Πίνακες με θέμα τη μυθολογία</h3><div class ="gallery"><figure><img src="images/pin1.png" alt="Ο Άτλας"/><figcaption>Ο Άτλας</figcaption></figure><figure><img src="images/pin2.png" alt="Ο Ιάσων"/><figcaption>Ο Ιάσων</figcaption></figure><figure><img src="images/pin3.png" alt="Ο προφητάναξ ∆αβίδ"/><figcaption>Ο προφητάναξ Δαβίδ</figcaption></figure><figure><img src="/images/pin4.png" alt="Αργώ"/><figcaption>Αργώ</figcaption></figure><figure><img src="images/pin5.png" alt="Ο Ερμής εν αναμονή"/><figcaption>Ο Ερμής εν αναμονή</figcaption></figure><figure><img src="images/pin6.png" alt="Ποιητής και Μούσα"/><figcaption>Ποιητής και Μούσα</figcaption></figure></div>',
  architecture:'<h3>Πίνακες με θέμα την αρχιτεκτονική σπιτιών</h3><div class ="gallery"><figure><img src="images/pin7.png" alt="Αθηναϊκή κατοικία Καλλιφρονά"/><figcaption>Αθηναϊκή κατοικία Καλλιφρονά</figcaption></figure><figure><img src="images/pin8.png" alt="Αθηναϊκή κατοικία Νεοκλασικού ρυθμού"/><figcaption>Αθηναϊκή κατοικία Νεοκλασικού ρυθμού</figcaption></figure><figure><img src="images/pin9.png" alt="Σπίτι Πηχεών στην Καστοριά "/><figcaption>Σπίτι Πηχεών στην Καστοριά</figcaption></figure><figure><img src="images/pin10.png" alt="Μπλε σπίτι"/><figcaption>Μπλε σπίτι</figcaption></figure><figure><img src="images/pin11.png" alt="Κτήριον Ζακύνθου"/><figcaption>Κτήριον Ζακύνθου</figcaption></figure><figure><img src="images/pin12.png" alt="Τοπίο Πειραιώς με άγαλμα (ντυμένο)"/><figcaption>Τοπίο Πειραιώς με άγαλμα (ντυμένο)</figcaption></figure></div>',
  watercolor:'<h3>Πίνακες σε ακουαρέλα με χαρτί</h3><div class ="gallery"><figure><img src="images/pin13.png" alt="Το ρομάντζο της πεντάρας"/><figcaption>Το ρομάντζο της πεντάρας</figcaption></figure><figure><img src="images/pin14.png" alt="Το Ρομάντζο της Πεντάρας"/><figcaption>Το Ρομάντζο της Πεντάρας</figcaption></figure><figure><img src="images/pin15.png" alt="Το Ρομάντζο της Πεντάρας"/><figcaption>Το Ρομάντζο της Πεντάρας</figcaption></figure><figure><img src="images/pin16.png" alt="Το Ρομάντζο της Πεντάρας"/><figcaption>Το Ρομάντζο της Πεντάρας</figcaption></figure><figure><img src="images/pin17.png" alt="Μήδεια"/><figcaption>Μήδεια</figcaption></figure><figure><img src="images/pin18.png" alt="Μήδεια"/><figcaption>Μήδεια</figcaption></figure></div>'
};

menuItems.forEach((menuItem) => {
  menuItem.addEventListener("click", (e) => {
      e.preventDefault();

      const targetId = e.target.getAttribute("href").replace("#","");

      submenus.forEach((menu_section) => {
      menu_section.classList.remove("active");
      });

      const targetMenu = document.getElementById(targetId + "-menu");
      if (targetMenu) {
      targetMenu.classList.add("active");
      }

      if (contentMap[targetId]) {
      mainContent.innerHTML = contentMap[targetId];
      } 
      else {
      mainContent.innerHTML="<p>Η ενότητα δεν είναι διαθέσιμη.</p>";
      }
    });
});

const sidebarLinks = document.querySelectorAll("aside a");
sidebarLinks.forEach((link) => {
  link.addEventListener("click", (e) => {
    e.preventDefault();

    const category = link.getAttribute("href").replace("#", ""); 

    if (contentm[category]) {
      mainContent.innerHTML = contentm[category];
    } else {
      mainContent.innerHTML = "<p>Δεν υπάρχει περιεχόμενο για αυτή την κατηγορία.</p>";
    }
  });
});

const loadExhibitions = (category) => {
  fetch('http://localhost:3000/api/exhibitions')
    .then((response) => {
      if (!response.ok) {
        throw new Error('Σφάλμα στη φόρτωση δεδομένων.');
      }
      return response.json();
    })
    .then((data) => {
      const mainContent = document.getElementById('main_content');
      let content = '';

      if (category === 'local_exhibitions') {
        // Τοπικές Εκθέσεις
        content += '<h3>Τοπικές Εκθέσεις</h3><ul>';
        data.local_exhibitions.forEach((exhibition) => {
          content += `<li>${exhibition.title} - ${exhibition.year} (${exhibition.location})</li>`;
        });
        content += '</ul>';
      } else if (category === 'international_exhibitions') {
        // Διεθνείς Εκθέσεις
        content += '<h3>Διεθνείς Εκθέσεις</h3><ul>';
        data.international_exhibitions.forEach((exhibition) => {
          content += `<li>${exhibition.title} - ${exhibition.year} (${exhibition.location})</li>`;
        });
        content += '</ul>';
      }

      mainContent.innerHTML = content;
    })
    .catch((err) => {
      console.error('Σφάλμα κατά τη φόρτωση των εκθέσεων:', err);
      document.getElementById('main_content').innerHTML = '<p>Δεν ήταν δυνατή η φόρτωση των δεδομένων.</p>';
    });
};

document.querySelectorAll('aside a').forEach((link) => {
  link.addEventListener('click', (e) => {
    e.preventDefault();

    const category = e.target.getAttribute('href').replace('#', ''); 

    if (category === 'local_exhibitions' || category === 'international_exhibitions') {
      loadExhibitions(category); // Κλήση με την κατάλληλη κατηγορία
    }
  });
});

const loadLinks = (category) => {
  fetch('http://localhost:3000/api/links')
    .then((response) => {
      if (!response.ok) {
        throw new Error('Σφάλμα στη φόρτωση δεδομένων.');
      }
      return response.json();
    })
    .then((data) => {
      const mainContent = document.getElementById('main_content');
      let content = `<h3>${category === "online_links" ? "Διαδικτυακοί Σύνδεσμοι" : "Σύνδεσμοι Βιβλιογραφίας"}</h3><ul>`;
      const links = category === "online_links" ? data.online_links : data.bibliography_links;

      links.forEach((link) => {
        content += `<li><a href="${link.url}" target="_blank">${link.title}</a></li>`;
      });
      content += "</ul>";
      mainContent.innerHTML = content;
    })
    .catch((err) => {
      console.error("Σφάλμα κατά τη φόρτωση των συνδέσμων:", err);
      document.getElementById('main_content').innerHTML = "<p>Δεν ήταν δυνατή η φόρτωση των δεδομένων.</p>";
    });
};

// Διαχείριση επιλογών μενού για συνδέσμους
document.querySelectorAll('aside a').forEach((link) => {
  link.addEventListener('click', (e) => {
    e.preventDefault();
    const category = e.target.getAttribute('href').replace('#', '');

    if (category === 'online_links' || category === 'bibliography_links') {
      loadLinks(category); // Κλήση για φόρτωση των συνδέσμων
    }
  });
});
});